src/AccumulationRegisters/ПартииПрочихРасходов/ПартииПрочихРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииПрочихРасходов</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяОтраженияРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПоступленияРасходов</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ПоступлениеУслугПрочихАктивов</types>
      <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.ПорчаТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПартий</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПартий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ПрочиеРасходы/ПрочиеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРеглБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПрочихАктивов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВариантыРаспределенияРасходов/ВариантыРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРаспределенияРасходов</name>
  <enumValues>
    <name>НаСебестоимостьТоваров</name>
  </enumValues>
  <enumValues>
    <name>НаНаправленияДеятельности</name>
  </enumValues>
  <enumValues>
    <name>НаРасходыБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>НаПроизводственныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>НаПрочиеАктивы</name>
  </enumValues>
  <enumValues>
    <name>НеРаспределять</name>
  </enumValues>
  <enumValues>
    <name>НаВнеоборотныеАктивы</name>
  </enumValues>
</mdclass:Enum>

src/AccumulationRegisters/ПартииПрочихРасходов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы


Функция ТекстОбработчиковОбновления() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расходы.Регистратор       КАК Ссылка,
	|	Расходы.МоментВремени     КАК МоментВремени,
	|	""РегистрНакопления""     КАК ТипМетаданных,
	|	""ПартииПрочихРасходов""  КАК ИмяМетаданных
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Расходы
	|ГДЕ
	|	Расходы.МоментВремени < &МоментВремени
	|	И Расходы.СтатьяРасходов.ВариантРаспределенияРасходов
	|		= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	И Расходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расходы.Регистратор       КАК Ссылка,
	|	Расходы.МоментВремени     КАК МоментВремени,
	|	""РегистрНакопления""     КАК ТипМетаданных,
	|	""ПрочиеРасходы""         КАК ИмяМетаданных
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Расходы
	|ГДЕ
	|	Расходы.МоментВремени < &МоментВремени
	|	И Расходы.СтатьяРасходов.ВариантРаспределенияРасходов
	|		= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	И Расходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции


Процедура ИсправитьВводОстатковТЗР_ДанныеДляОбновления(Параметры) Экспорт
    
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВводОстатков КАК Документ
	|	ПО
	|		ДанныеРегистра.Регистратор = Документ.Ссылка
    |
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВводОстатков.ПрочиеРасходы КАК ДанныеДокументаРасходы
	|	ПО
	|		ДанныеДокументаРасходы.Ссылка = Документ.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|	ПО
	|		ДанныеДокументаРасходы.СтатьяРасходов = СтатьиРасходов.Ссылка
	|
	|ГДЕ
	|	ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатков
    |   И СтатьиРасходов.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|");
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
        Параметры, 
        Регистраторы, 
        "РегистрНакопления.ПартииПрочихРасходов"
    );
    
КонецПроцедуры

Процедура ИсправитьВводОстатковТЗР(Параметры) Экспорт
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.ВводОстатков");
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		Регистраторы,
		"РегистрНакопления.ПартииПрочихРасходов",
		Параметры.Очередь);
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#КонецЕсли
